{
  "allSessions": [
    {
      "speaker": {
        "name": "Christian Heilmann",
        "photo": "https://2009.ffconf.org/images/speakers/christian.jpg",
        "twitter": "codepo8",
        "bio": "Web Architect and standards evangelist at Yahoo UK: Frontloaded and zipped up - do loose types sink ships."
      },
      "slides": null,
      "event": {
        "year": 2009
      },
      "description": "JavaScript had a bumpy ride up to now, from its origins as a CGI-replacement, initiator of countless popups and annoying effects over the renaissance as Ajax enabler up to becoming wrapped up in libraries to work around the hell that is browser differences.\n\n\n\nWith the ubiquity of JavaScript comes a new challenge. How do we keep JavaScript safe when browsers don't really distinguish between different sources and give them all the same rights? Why do we still judge the usefulness of JavaScript by how badly browsers speak it?\n\n\n\nLearn about some environments you can use JavaScript in securely and marvel at the magic and annoyances that are technologies that try to put a lock on the issue of JavaScript security.",
      "audio": null,
      "slug": "frontloaded-and-zipped-up-do-loose-types-sink-ships",
      "order": 1,
      "video": null,
      "title": "Frontloaded and zipped up - do loose types sink ships?"
    },
    {
      "speaker": {
        "name": "Alex Russell",
        "photo": "https://2010.ffconf.org/images/speakers/alex_profile.jpg",
        "twitter": "slightlylate",
        "bio": "Alex Russell is a software engineer at Google. Prior to joining Google he contributed to the development of the Dojo Toolkit. He's fighting IE 6 so you don't have to."
      },
      "slides": null,
      "event": {
        "year": 2010
      },
      "description": "HTML5, CSS3, and whatever come with and after them are going to once again change the way we build web sites and apps, and in ways that are just a profound as the transition to Ajax for dynamic interactions.\n\n\n\nThis talk discusses what we'll be using JavaScript less (and more) for in the years to come and how mobile, the Chrome Web Store, and Google Chrome Frame will accelerate the transition",
      "audio": null,
      "slug": "less-and-more-how-html5-will-change-the-framework-landscape",
      "order": 1,
      "video": null,
      "title": "Less and More: How HTML5 Will Change The Framework Landscape"
    },
    {
      "speaker": {
        "name": "Jeremy Ashkenas",
        "photo": "https://2011.ffconf.org/images/speakers/jeremy.jpg",
        "twitter": "jashkenas",
        "bio": "Jeremy Ashkenas works on CoffeeScript, Backbone.js, Underscore.js, Docco, and Jammit, among other opensource projects."
      },
      "slides": null,
      "event": {
        "year": 2011
      },
      "description": "Although limited by what's possible to express in simple JavaScript, CoffeeScript tries to provide pieces of clear syntax that fit together in harmony. We'll dive into the rationale behind some of CoffeeScript's language choices to look at the trade offs involved, and both the why's and why not's.",
      "audio": null,
      "slug": "coffeescript-design-decisions",
      "order": 1,
      "video": null,
      "title": "CoffeeScript Design Decisions"
    },
    {
      "speaker": {
        "name": "James Kyle",
        "photo": "https://2017.ffconf.org/images/speakers/james.gif",
        "twitter": "thejameskyle",
        "bio": "I dropped out of high school at 16, made email templates for a marketing internship, then started selling WordPress installs for $50"
      },
      "slides": null,
      "event": {
        "year": 2017
      },
      "description": "Evolving the web to improve education, accessibility, performance, productivity, and design.",
      "audio": null,
      "slug": "rethinking-the-web-platform",
      "order": 1,
      "video": null,
      "title": "Rethinking the Web Platform"
    },
    {
      "speaker": {
        "name": "Rachel Andrew",
        "photo": "https://2016.ffconf.org/images/speakers/rachel.jpg",
        "twitter": "rachelandrew",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2016
      },
      "description": "While we were all looking the other way browsers have been implementing CSS features that do things you might think you need JavaScript or at least a pre-processor to achieve. We’ll take a tour through what is landing in the CSS specifications and your browsers right now and in the very near future.",
      "audio": null,
      "slug": "next-level-css",
      "order": 1,
      "video": null,
      "title": "Next Level CSS"
    },
    {
      "speaker": {
        "name": "Robin Mehner",
        "photo": "https://2015.ffconf.org/images/speakers/robin.jpg",
        "twitter": "rmehner",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2015
      },
      "description": "JavaScript just had its 20th birthday this year and it has come a long way. But many fail to recognise this and still code like it’s 1999. This talk will take you through my favourite features of recent JavaScript editions, shows you how to use them in your project today and will give you an outlook of even better things to come.",
      "audio": null,
      "slug": "javascript-that-doesnt-hurt-your-feelings",
      "order": 1,
      "video": null,
      "title": "JavaScript that doesn’t hurt your feelings"
    },
    {
      "speaker": {
        "name": "Scott Jenson",
        "photo": "https://2014.ffconf.org/images/speakers/scott.jpg",
        "twitter": "scottjenson",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2014
      },
      "description": "How can we, as the web community, build the next generation of the web, the Physical Web, together?",
      "audio": null,
      "slug": "building-the-physical-web-together",
      "order": 1,
      "video": null,
      "title": "Building the Physical Web together"
    },
    {
      "speaker": {
        "name": "Angus Croll",
        "photo": "https://2013.ffconf.org/images/speakers/angus.jpg",
        "twitter": "angustweets",
        "bio": "Angus is a displaced Brit who now works for Twitter’s web platform team in San Francisco, and is one of the principal authors and maintainers of Twitter's Flight web framework. He's obsessed with JavaScript and literature in equal measure, and is a passionate advocate for the greater involvement of artists and creative thinkers in software."
      },
      "slides": null,
      "event": {
        "year": 2013
      },
      "description": "The latest JavaScript standard is just around the corner and language enthusiasts are already salivating over all the new toys coming their way. But, be warned, there are best practice zealots waiting in the wings, ready to re-label the fun parts as The Bad Parts and ruin the party. This time let's get a head start on them.\n\n\n\nWith copious examples drawing on various novel, weird and wacky combinations of upcoming features, I'll show you how to go wild with ES6 and, in the process, demonstrate that play is healthy and censorship is regressive.",
      "audio": null,
      "slug": "es6-uncensored",
      "order": 1,
      "video": null,
      "title": "ES6 Uncensored"
    },
    {
      "speaker": {
        "name": "Paul Kinlan",
        "photo": "https://2012.ffconf.org/images/speakers/paul.png",
        "twitter": "Paul_Kinlan",
        "bio": "Developer Advocate @ Google on Chrome. Mr [Web Intents](http://webintents.org). Developer of many techie things including Twollo, Twe2, Topicala, Ahoyo and FriendDeck."
      },
      "slides": null,
      "event": {
        "year": 2012
      },
      "description": "\"I skate to where the puck is going to be, not where it has been.\" - Wayne Gretzky. Building apps using AppCache and IndexedDb.  Pfft! That is so 2011.  The browser is an amazing runtime that can already deliver amazing apps.  Let's dive into the technologies that will help you deliver amazing web apps that blow your users socks off now and in the future.\n\n\n\n",
      "audio": null,
      "slug": "building-web-apps-of-the-future-tomorrow-today-and-yesterday",
      "order": 1,
      "video": null,
      "title": "Building Web Apps of the future. Tomorrow, today and yesterday."
    },
    {
      "speaker": {
        "name": "Jo Franchetti",
        "photo": "https://media.ffconf.org/2018/images/jo.jpg",
        "twitter": "ThisIsJoFrank",
        "bio": "After studying (and hating) electronic engineering, I thought I'd teach myself HTML/CSS as a better fit for my love of tech+creativity. I wrote some terrible portfolio sites, applied for 50 million jobs and eventually one let me start my career! "
      },
      "slides": "",
      "event": {
        "year": 2018
      },
      "description": "The tech industry is suffering; from bad role models and unrealistic expectations, from anxiety and impostor syndrome and from a lack of diversity, empathy and ethical consideration.   Everyone, no matter how junior, can mentor and be a hero for someone else, for the industry and for yourself.",
      "audio": "",
      "slug": "mentoring",
      "order": 1,
      "video": "",
      "title": "Mentoring: Being the help you wish you'd had"
    },
    {
      "speaker": {
        "name": "Robert Nyman",
        "photo": "https://2009.ffconf.org/images/speakers/robert.jpg",
        "twitter": "robertnyman",
        "bio": "Working in the frontend since 1998, talking about JavaScript: from birth to closure."
      },
      "slides": null,
      "event": {
        "year": 2009
      },
      "description": "This presentation will give you a brief background to JavaScript, what it is and where it comes from. Then it will walk you through general pitfalls, best practices and more advanced topics such as object-orientation, scope and closures.",
      "audio": null,
      "slug": "javascript-from-birth-to-closure",
      "order": 2,
      "video": null,
      "title": "JavaScript: from birth to closure"
    },
    {
      "speaker": {
        "name": "Phil Hawksworth",
        "photo": "https://2011.ffconf.org/images/speakers/phil.jpg",
        "twitter": "philhawksworth",
        "bio": "Phil is a JavaScript developer who has been developing web applications since the late 90s. These days, he's the Technical Director for The Team."
      },
      "slides": null,
      "event": {
        "year": 2011
      },
      "description": "We all love to see exciting and innovative \"interface shizzle\" driven by JavaScript and the ever increasing rendering capabilities of modern browsers, but are we getting these at the expense of the Web? This talk will explore the good, the bad, and the fugly of rich interfaces, while examining how and why we should take care not to damage the Web.",
      "audio": null,
      "slug": "excessive-enhancement-are-we-taking-proper-care-of-the-web",
      "order": 2,
      "video": null,
      "title": "Excessive Enhancement - Are we taking proper care of the Web?"
    },
    {
      "speaker": {
        "name": "Jan Lehnardt",
        "photo": "https://2010.ffconf.org/images/speakers/jan_profile.jpg",
        "twitter": "janl",
        "bio": "Jan is a contributor to Apache CouchDB and co-organizer of JSConf.eu, the other great JavaScript conference."
      },
      "slides": null,
      "event": {
        "year": 2010
      },
      "description": "This talk is a gentle introduction into the nebulous topic of the peer to peer web. We'll have a look at mobile devices, laptops, desktops and the cloud and how they all fit together today and how it it is already shaping up to look in the future.\n\n\n\nI'll highlight some technical and social hurdles that need solving (this is where I hope to get you, the listener engaged in helping to shape the future).\n\n\n\nFinally, I'll propose how Apache CouchDB is one of the foundational building blocks of our peer to peer future.",
      "audio": null,
      "slug": "about-the-peer-to-peer-web-and-why-you-should-care",
      "order": 2,
      "video": null,
      "title": "About the Peer to Peer Web and Why You Should Care"
    },
    {
      "speaker": {
        "name": "Bruce Lawson",
        "photo": "https://2017.ffconf.org/images/speakers/bruce.gif",
        "twitter": "brucel",
        "bio": "1981, my Physics teacher made up a UK101 kit in a tiny computer room which I could use instead of Physical Exercise. So I programmed games."
      },
      "slides": null,
      "event": {
        "year": 2017
      },
      "description": "We do like our Holy Wars, don't we?: tables vs CSS? Responsive vs mdot? React vs Angular? CSS or CSS-in-JS? Let's look at the real issue: getting the free and open web to the other 4 billion people.",
      "audio": null,
      "slug": "if-youre-going-out-of-san-francisco-be-sure-to-wear-web-standards-in-your-hair",
      "order": 2,
      "video": null,
      "title": "If you're going out of San Francisco, be sure to wear Web Standards in your hair"
    },
    {
      "speaker": {
        "name": "Ada Rose Edwards",
        "photo": "https://2016.ffconf.org/images/speakers/ada.jpg",
        "twitter": "Lady_Ada_King",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2016
      },
      "description": "With new web technologies enabling a new generation of install-able app-like websites it is important to ensure the web carries on working for everyone. This talk will discuss the P in PWA, progressive web apps should work for everyone and should not let their app-like approach divorce them from the web.",
      "audio": null,
      "slug": "progressive-web",
      "order": 2,
      "video": null,
      "title": "Progressive Web"
    },
    {
      "speaker": {
        "name": "Sara Soueidan",
        "photo": "https://2015.ffconf.org/images/speakers/sara.jpg",
        "twitter": "sarasoueidan",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2015
      },
      "description": "Scalable Vector Graphics (SVG) are taking over a lot of our design tools by offering us more flexibility over those tools. In this talk, we will cover everything we need to know before attempting to animate SVGs, including animation gotchas, how-tos and pre-animation requisites such as optimization and embedding, among others, and how each of those affects the animation process.",
      "audio": null,
      "slug": "svg-in-motion",
      "order": 2,
      "video": null,
      "title": "SVG in motion"
    },
    {
      "speaker": {
        "name": "Andrew Nesbitt",
        "photo": "https://2013.ffconf.org/images/speakers/andrewnesbitt.jpg",
        "twitter": "teabass",
        "bio": "Andrew is a passionate full stack developer. He spends most of his days programming in Ruby, playing with Node.js, contributing to open source projects and organising local developer user groups. He also aspires to one day take over the world with a fleet of JavaScript powered quadcopters."
      },
      "slides": null,
      "event": {
        "year": 2013
      },
      "description": "Anything that can be written in JavaScript, will eventually be written in JavaScript. First client side web apps, then server side programs and now you can control hardware, embedded devices and even flying robots with JavaScript.\n\n\n\nWe'll look at how you can get started writing JavaScript for Arduino and Raspberry Pi to read sensors and control servos and build your own JavaScript powered robots.",
      "audio": null,
      "slug": "javascript-in-the-real-world",
      "order": 2,
      "video": null,
      "title": "JavaScript in the Real World"
    },
    {
      "speaker": {
        "name": "Caolan McMahon",
        "photo": "https://2014.ffconf.org/images/speakers/caolan.jpg",
        "twitter": "caolan",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2014
      },
      "description": "Unlike the always-wired machines of the past, computers are now truly personal, and people move through online and offline seamlessly. We'll explore how and why our apps should do the same, using Hood.ie and offline-first principles to do it in record time.",
      "audio": null,
      "slug": "moving-seamlessly-through-offline-and-online",
      "order": 2,
      "video": null,
      "title": "Moving seamlessly through offline and online"
    },
    {
      "speaker": {
        "name": "Rebecca Murphey",
        "photo": "https://2012.ffconf.org/images/speakers/rebecca.png",
        "twitter": "rmurphey",
        "bio": "Senior JS dev at [Bocoup](http://bocoup.com/), client-side architecture fanatic, co-host of the long-lost [yayQuery](http://yayquery.com/) podcast"
      },
      "slides": null,
      "event": {
        "year": 2012
      },
      "description": "It's one thing to write the code you need to write to get something working; it's another thing to write the code you need to write if you want to be able to prove that it works -- and that it keeps working as you refactor and add new features. In this talk, we'll look at what it means to write testable JavaScript code, and even write and run a few tests using [Grunt](http://gruntjs.com/) and the [Mocha](http://visionmedia.github.com/mocha/) testing framework.\n\n\n\n",
      "audio": null,
      "slug": "writing-testable-javascript",
      "order": 2,
      "video": null,
      "title": "Writing Testable JavaScript"
    },
    {
      "speaker": {
        "name": "Eleanor Haproff",
        "photo": "https://media.ffconf.org/2018/images/eleanor.jpg",
        "twitter": "EleanorHaproff",
        "bio": "Founded a startup, ran out of money, had to learn to code to build the product and absolutely loved it. Decided to be a developer."
      },
      "slides": "",
      "event": {
        "year": 2018
      },
      "description": "Deep learning, computer vision, natural-language processing, robotics - there are many exciting things happening with ai and machine learning, but where does JavaScript fit in with all of this? ",
      "audio": "",
      "slug": "the-future-of-javascript-machine-learning",
      "order": 2,
      "video": "",
      "title": "The Future of JavaScript & Machine Learning"
    },
    {
      "speaker": {
        "name": "Peter-Paul Koch",
        "photo": "https://2009.ffconf.org/images/speakers/peter-paul.jpg",
        "twitter": "ppk",
        "bio": "The author of the infinitely useful QuirksMode talking about: W3C Widgets."
      },
      "slides": null,
      "event": {
        "year": 2009
      },
      "description": "In this session we'll discuss W3C Widgets and why they are the future of the mobile Web. We'll also take a look at various practical problems that surround the creation of W3C Widgets and mobile websites. Although web developers are well prepared for many of the browser incompatibilities they're sure to encounter, there are some special problems that occur only on mobile devices. We will discuss these problems.\n\n\n\nIf the mobile web is new to you you'll be shocked by the sheer size of the problems mobile devices create, and the sheer depth of our ignorance. Nonetheless, there is a thin ray of light at the end of the tunnel, and we'll end on a more positive note by looking to the future.",
      "audio": null,
      "slug": "w3c-widgets",
      "order": 3,
      "video": null,
      "title": "W3C Widgets"
    },
    {
      "speaker": {
        "name": "Marijn Haverbeke",
        "photo": "https://2011.ffconf.org/images/speakers/marijn.jpg",
        "twitter": "MarijnJH",
        "bio": "Author of Eloquent JavaScript and main developer of CodeMirror."
      },
      "slides": null,
      "event": {
        "year": 2011
      },
      "description": "The past few years have seen the rise and maturation of several full-blown in-browser code editors: CodeMirror, ACE (Cloud9), and Orion. No longer must we mortify users with huge, clunky text areas when they need to edit some CSS or script. This talk will go over the current state of JavaScript-based editors, and describe the implementation of CodeMirror in some depth.",
      "audio": null,
      "slug": "respectable-code-editing-in-the-browser",
      "order": 3,
      "video": null,
      "title": "Respectable code-editing in the browser"
    },
    {
      "speaker": {
        "name": "Paul Rouget",
        "photo": "https://2010.ffconf.org/images/speakers/paulr_profile.jpg",
        "twitter": "paulrouget",
        "bio": "Paul Rouget works on promoting the OpenWeb and Mozilla as a platform. He has been involved in the Mozilla project since 2003. He works for Mozilla as a Technology Evangelist. Paul experiments with the new technologies of the Web and the Mozilla platform. Lately, he has been working on set of demos demonstrating how far we can go with the new standards and Firefox 3.5, and promoting the new video tag on Firefox."
      },
      "slides": null,
      "event": {
        "year": 2010
      },
      "description": "SVG, CSS3, HTML5, Workers, Video, WebGL, super fast Javascript engines, hardware accelerated graphics - let's see how far we can go if we mix all these crazy things.\n\n\n\nThis talk is an experiment. You'll cry, you'll scream, you'll laugh...and hopefully, will get inspired!",
      "audio": null,
      "slug": "batshit-crazy-stuff-youll-be-able-to-do-in-browsers",
      "order": 3,
      "video": null,
      "title": "Batshit crazy stuff you'll be able to do in browsers"
    },
    {
      "speaker": {
        "name": "Monica Dinculescu",
        "photo": "https://2017.ffconf.org/images/speakers/monica.gif",
        "twitter": "notwaldorf",
        "bio": "I found out my mum always won at the QBasic Gorrilas game bc she changed the other player's code to randomly miss. Then she taught me how."
      },
      "slides": null,
      "event": {
        "year": 2017
      },
      "description": "They say there's two things you never want to see made: sausages and web standards. Sooooo I'm going to tell you about both! How do browsers work? What are web components even? Everyone's using them and maybe you should too! 🆒🐱🎉",
      "audio": null,
      "slug": "how-the-web-sausage-gets-made",
      "order": 3,
      "video": null,
      "title": "How the web sausage gets made"
    },
    {
      "speaker": {
        "name": "Léonie Watson",
        "photo": "https://2016.ffconf.org/images/speakers/leonie.jpg",
        "twitter": "LeonieWatson",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2016
      },
      "description": "With a little help from Daft Punk, we will explain accessibility mechanics in the browser, why CSS isn't just about looking good, and what tools you can use to get ahead of the game.",
      "audio": null,
      "slug": "technologic-human-after-all-accessibility-remix",
      "order": 3,
      "video": null,
      "title": "Technologic (Human After All): Accessibility remix"
    },
    {
      "speaker": {
        "name": "Anna Shipman",
        "photo": "https://2015.ffconf.org/images/speakers/anna.jpg",
        "twitter": "annashipman",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2015
      },
      "description": "An introduction to the web ops skills that will help you be a better developer. What you need to know about virtualisation, containerisation and wrangling servers, and some tools we use that might make development easier. I spent two years on the infrastructure team so you don't have to!",
      "audio": null,
      "slug": "operations-a-developers-guide",
      "order": 3,
      "video": null,
      "title": "Operations: a developer's guide"
    },
    {
      "speaker": {
        "name": "Hannah Wolfe",
        "photo": "https://2014.ffconf.org/images/speakers/hannah.jpg",
        "twitter": "ErisDS",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2014
      },
      "description": "Distributed, Non-Profit, Sustainable and Open Source: Ghost does nothing the easy way. Discover why the project made these choices and how they're creating a community and shipping code in the open.",
      "audio": null,
      "slug": "navigating-open-source",
      "order": 3,
      "video": null,
      "title": "Navigating Open Source"
    },
    {
      "speaker": {
        "name": "Chris Wilson",
        "photo": "https://2012.ffconf.org/images/speakers/chris.png",
        "twitter": "cwilso",
        "bio": "Chris Wilson has worked on NCSA Mosaic, IE and now Chrome as an Open Web advocate.  He loves enabling awesome user experiences on the web."
      },
      "slides": null,
      "event": {
        "year": 2012
      },
      "description": "This talk is an exploration of how the web has evolved since its humble beginnings in the early 1990s, from high and low points in the trenches of the Browser Wars to the enviable opportunities and sizable challenges we face today, and draws the connections between the choices made then and the landscape we find ourselves in today.\n\n\n\n",
      "audio": null,
      "slug": "tales-of-suckage-and-awesomeness",
      "order": 3,
      "video": null,
      "title": "Tales of Suckage and Awesomeness"
    },
    {
      "speaker": {
        "name": "Joe McCann",
        "photo": "https://2013.ffconf.org/images/speakers/happy-joe.jpg",
        "twitter": "joemccann",
        "bio": "Joe McCann is the Director of Creative Technology at Mother, an award-winning creative agency in New York City and he is also a Managing Director and Partner at The Node Firm, a global collective of Node.js experts and enthusiasts.\n\n\n\nJoe's experience in various industries is widespread: from music and live events, to fashion, to Wall Street and even real estate, the perspective he brings to the mobile, design and software engineering industries is extremely rare and unique. Joe advises a number of technology startups and has spoken at conferences all over the world including SXSW, Adobe Phonegap Day (Amsterdam), Android Only (Stockholm),  PulsoConf (Bogota, Colombia), Morningstar Financial Developers Conference (Chicago) and many, many more."
      },
      "slides": null,
      "event": {
        "year": 2013
      },
      "description": "The stratospheric rise in mobile subscribers, devices, services and apps has led to an even bigger explosion in the lack of understanding of how to design, develop and most importantly, recognize new opportunities with not only these new devices, but new use cases altogether.\n\n\n\nLet's step through the processes to help identify content strategies, design workflows and forecasting methods to unlock the true potential of mobile, not only for apps, but for the web and new channels of communication altogether.",
      "audio": null,
      "slug": "mobile-is-not-a-thing-it-is-everything",
      "order": 3,
      "video": null,
      "title": "Mobile Is Not A Thing; It Is Everything."
    },
    {
      "speaker": {
        "name": "Lisi Linhart",
        "photo": "https://media.ffconf.org/2018/images/lisi.jpg",
        "twitter": "lisi_linhart",
        "bio": "Studied city planning for some time, but since I’m quite an impatient person and it takes decades to build cities, I decided to build websites instead. Still loving having immediate results and instant feedback from people interacting with what I build."
      },
      "slides": "",
      "event": {
        "year": 2018
      },
      "description": "Web Animation is an essential part of great user experience leveraging cognitive load and allowing us to provide user feedback. This talk examines Web Animation from a practical standpoint, answering when to use it, how to keep your animations performant from a browser standpoint and exploring the animation options we have on the web today. ",
      "audio": "",
      "slug": "web-animation",
      "order": 3,
      "video": "",
      "title": "Practical Web Animation"
    },
    {
      "speaker": {
        "name": "Stuart Langridge",
        "photo": "https://2009.ffconf.org/images/speakers/stuart.jpg",
        "twitter": "sil",
        "bio": "Stuart is a web hacker, author, and speaker living in the UK, talking about: New things that HTML5 provides to JavaScript hackers."
      },
      "slides": null,
      "event": {
        "year": 2009
      },
      "description": "HTML5 brings new and exciting JavaScript things within our reach. Browser manufacturers are constantly changing and improving their JavaScript engines to give us, the web hackers, abilities that we never had before.\n\n\n\nHere you'll find information on the parts that are coming up that maybe you knew about, the parts coming up that you may be excited to discover, and some thoughts on what's standing between us and greatness.",
      "audio": null,
      "slug": "new-things-that-html5-provides-to-javascript-hackers",
      "order": 4,
      "video": null,
      "title": "New things that HTML5 provides to JavaScript hackers"
    },
    {
      "speaker": {
        "name": "Rik Arends",
        "photo": "https://2011.ffconf.org/images/speakers/rik.jpg",
        "twitter": "rikarends",
        "bio": "Rik Arends is co-founder and CTO of Cloud9 IDE, Inc (previously Ajax.org)."
      },
      "slides": null,
      "event": {
        "year": 2011
      },
      "description": "Building and scaling a web based IDE is a big challenge, and doing this on Node.JS gave us a lot of unique challenges. Cloud9 is built using a full Ajax client, and besides Node.JS utilizes a full set of new HTML5 features and offline support. In this talk Rik will go through a quick demo of Cloud9 IDE, and then into the unique architecture and design decisions that we made to build Cloud9 IDE. This will be of interest to medium to advanced level programmers, who want to know more about Cloud9 IDE, Node.JS and scalable app development.",
      "audio": null,
      "slug": "how-we-architected-cloud9-ide-for-scale-on-nodejs",
      "order": 4,
      "video": null,
      "title": "How we Architected Cloud9 IDE for scale on NodeJS"
    },
    {
      "speaker": {
        "name": "Dan Webb",
        "photo": "https://2010.ffconf.org/images/speakers/dan_profile.jpg",
        "twitter": "danwrong",
        "bio": "Dan Webb is a british JavaScript bloke working on the platform team at Twitter. Recently he's spent a lot of time delving into the dark recesses of cross domain communication and security while working on @anywhere. In the past, as director of Massive Robot, he's been involved in a wide range of projects including work for Channel 4, A Bathing Ape and People's Music Store as well as popular Twitter app, twaud.io. When he's not doing that he's DJing, hording trainers and drinking fine beers."
      },
      "slides": null,
      "event": {
        "year": 2010
      },
      "description": "More and more web applications are seeing the opportunities that can arise from exposing their features on third party websites. We've already seen a lot of read-only 'badges' that allow third parties sites to display information from your application but now companies like Facebook, Twitter and Linkedin are allowing users of 3rd party sites to actually use their applications without leaving the site. We'll dig in to what it takes to responsibly and effectively embed your application's functionality in other sites, looking at the arcane technology that powers the Like, Share and Tweet buttons going all the way through to implementing full JavaScript APIs to your application in the style of @anywhere, Facebook Connect and Linkedin's JSAPI.",
      "audio": null,
      "slug": "bringing-the-same-origin-policy-to-its-knees",
      "order": 4,
      "video": null,
      "title": "Bringing the Same-Origin policy to its knees"
    },
    {
      "speaker": {
        "name": "Addy Osmani",
        "photo": "https://2017.ffconf.org/images/speakers/addy.gif",
        "twitter": "addyosmani",
        "bio": "At 16, wrote a web browser in C++ to understand how HTML, CSS and JavaScript worked…15 years later, still learning"
      },
      "slides": null,
      "event": {
        "year": 2017
      },
      "description": "Discover what slows down modern apps on mobile and how to fix this.",
      "audio": null,
      "slug": "lessons-learned-sciencing-the-web",
      "order": 4,
      "video": null,
      "title": "Lessons learned sciencing the web"
    },
    {
      "speaker": {
        "name": "John K. Paul",
        "photo": "https://2015.ffconf.org/images/speakers/john.jpg",
        "twitter": "johnkpaul",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2015
      },
      "description": "Natural languages have many nooks and crannies, but there's a particular rabbit hole that will obsess you from the start. In this talk, you'll learn about the oddest psychological phenomenon ever to be thrown at getUserMedia and the odd parallels between learning human, natural languages and learning programming languages.",
      "audio": null,
      "slug": "the-web-audio-phenomenon-that-shall-not-be-named",
      "order": 4,
      "video": null,
      "title": "The Web Audio Phenomenon that Shall Not Be Named"
    },
    {
      "speaker": {
        "name": "Andy Wingo",
        "photo": "https://2014.ffconf.org/images/speakers/andy.jpg",
        "twitter": "andywingo",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2014
      },
      "description": "The parts of V8 and SpiderMonkey that are actually written in JS.  Let's implement an ES.next feature in JS, during the talk!",
      "audio": null,
      "slug": "self-hosted-js",
      "order": 4,
      "video": null,
      "title": "Self-hosted JS"
    },
    {
      "speaker": {
        "name": "Andrew Martin",
        "photo": "https://2016.ffconf.org/images/speakers/andrew.jpg",
        "twitter": "sublimino",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2016
      },
      "description": "Continuous Deployment for everybody: from a one-person army to distributed teams. Ecosystem appraisal, time-saving tips, max velocity!",
      "audio": null,
      "slug": "all-things-continuous",
      "order": 4,
      "video": null,
      "title": "All Things Continuous"
    },
    {
      "speaker": {
        "name": "Andrew Grieve",
        "photo": "https://2013.ffconf.org/images/speakers/agrieve.jpg",
        "twitter": "grieveandrew",
        "bio": "Andrew is a developer at Google who has worked on several mobile web projects, including Gmail and Google Docs. More recently, he's been leading a team working full-time on Cordova Android & iOS ports, both as part of the \"make the web better\" initiative, as well as a part of the Chrome Apps team"
      },
      "slides": null,
      "event": {
        "year": 2013
      },
      "description": "A focus on performance can make the difference between the success or failure of a web app. This talk will go through concrete examples of how the Mobile Gmail and Docs teams focused on performance when building their apps. Some of these techniques are well known, but others have not been shared before...",
      "audio": null,
      "slug": "pushing-the-limits-of-mobile-performance",
      "order": 4,
      "video": null,
      "title": "Pushing the Limits of Mobile Performance"
    },
    {
      "speaker": {
        "name": "Steven Wittens",
        "photo": "https://2012.ffconf.org/images/speakers/steven.png",
        "twitter": "unconed",
        "bio": "[Steven Wittens](http://acko.net) is a wannabe demo scener, recreational mathematician and maker of webs front and back who desperately wants the browser to become a real boy already."
      },
      "slides": null,
      "event": {
        "year": 2012
      },
      "description": "For years the web has been happy playing in the sandbox that was the browser, locked away from all the things that native apps could do. But now we've grown up, and we have WebGL, Canvas, Web Audio, Media Capture and more. To really exploit this power, we have to step outside the comfort zone of text-oriented publishing and engage with the full field of computer engineering.\n\n\n\nMaths are an essential part of this. While for most people, maths inspires dread, it's the most powerful tool we have, and the most flexible lego set you can get your hands on. In this talk I want to show you some clever mathematical machines, and what the pieces inside are doing. In a browser, naturally. And while true mathematicians will frown at the clear disregard for rigorous derivation, I think my way is more fun.\n\n\n\n",
      "audio": null,
      "slug": "making-things-with-maths",
      "order": 4,
      "video": null,
      "title": "Making things with Maths"
    },
    {
      "speaker": {
        "name": "Jenny Wong",
        "photo": "https://media.ffconf.org/2018/images/jenny.jpg",
        "twitter": "miss_jwo",
        "bio": "Combining an electronics & art background, they joined the tech world as a PHP developer and now works as a Community Engineer."
      },
      "slides": "",
      "event": {
        "year": 2018
      },
      "description": "Often in our industry, aiming to increase diversity has been about finding people and trying to make them fit the mould of your event, project or team.  How about changing the goal to making environments that could accommodate people from all headspaces, including people we haven't met yet?",
      "audio": "",
      "slug": "is-it-possible-to-build-a-truly-diverse-community",
      "order": 4,
      "video": "",
      "title": "Is it possible to build a truly diverse community?"
    },
    {
      "speaker": {
        "name": "Todd Kloots",
        "photo": "https://2009.ffconf.org/images/speakers/todd.jpg",
        "twitter": "todd",
        "bio": "Frontend engineer working on the YUI library, talking about More accessible user interfaces with ARIA."
      },
      "slides": null,
      "event": {
        "year": 2009
      },
      "description": "ARIA is a W3C specification that can be used to dramatically improve the accessibility of DHTML widgets and rich interaction patterns (like drag and drop). This talk provides practical tips and design patterns for using ARIA to create accessible user interfaces that work across all of the various combinations of browsers and assistive technology that support ARIA.\n\n\n\nAdditionally, this talk will focus on the tools and methodologies developers need to test ARIA in order to ensure the best possible user experience.",
      "audio": null,
      "slug": "more-accessible-user-interfaces-with-aria",
      "order": 5,
      "video": null,
      "title": "More accessible user interfaces with ARIA"
    },
    {
      "speaker": {
        "name": "Nicholas Zakas",
        "photo": "https://2011.ffconf.org/images/speakers/nicholas.jpg",
        "twitter": "slicknet",
        "bio": "Nicholas C. Zakas worked at Yahoo! for almost five years, building and defining front-end strategy for some of Yahoo's largest sites."
      },
      "slides": null,
      "event": {
        "year": 2011
      },
      "description": "Building large web applications with dozens of developers is a difficult task. Organising the engineers around a common goal is one thing, but organising your code so that people can work efficiently is another. Many large applications suffer from growing pains after just a few months in production due to poorly designed JavaScript with unclear upgrade and extension paths. Learn the tips, tricks, and techniques that allowed large sites such as My Yahoo! and the Yahoo! homepage to continue to grow, scale, and change over time without throwing away previous work. This talk isn't specific to any JavaScript library, rather, it gives you new ways to apply the libraries you're already using. The principles of good, loosely-coupled design apply to any system, and you'll learn how this can help your application today.",
      "audio": null,
      "slug": "scalable-javascript-application-architecture",
      "order": 5,
      "video": null,
      "title": "Scalable JavaScript Application Architecture"
    },
    {
      "speaker": {
        "name": "Paul Bakaus",
        "photo": "https://2010.ffconf.org/images/speakers/paul_profile.jpg",
        "twitter": "pbakaus",
        "bio": "Paul is the CTO of the browser game startup Dextrose AG, as well as a jQuery team member and his corporate work mostly focusses on UX, UI and tricky JavaScript challenges. He is well known in the JavaScript community for having created the popular user interface framework jQuery UI, where he was the driving force behind many of its plugins.\n\n\n\nIn 2010, he finally decided it‘s time for a long envisioned challenge – delivering the first commercial game engine for the web, running pluginless in web browsers. In addition to his main work, he enjoys his well booked speaking engagements at various conferences around the world. His favorite topics cover innovative user interfaces and experiences, JavaScript wisdom and of course, jQuery."
      },
      "slides": null,
      "event": {
        "year": 2010
      },
      "description": "Graphically intensive and fast paced browser games written in pluginless JavaScript largely do not exist yet, for a very specific reason – performance issues.\n\n\n\nOnly recently, browser engines started to give us enough quirks and hacks to power full motion graphics, animation and real time interaction. With unprecedented depth, you'll learn why Canvas isn't the obvious choice, why you should write JavaScript in front- and backend, why HTML5 really is just a buzzword and how to leverage CSS hardware accelerated to create true platform independent games. Dive in to the world of JavaScript gaming!",
      "audio": null,
      "slug": "high-performance-browser-games",
      "order": 5,
      "video": null,
      "title": "High performance browser games"
    },
    {
      "speaker": {
        "name": "Blaine Cook",
        "photo": "https://2017.ffconf.org/images/speakers/blaine.gif",
        "twitter": "blaine",
        "bio": "A glowing green screen, still fascinating despite its sole output: \"SYNTAX ERROR\"; Years later, the moment I used ATA and ATDT to talk to a friend."
      },
      "slides": null,
      "event": {
        "year": 2017
      },
      "description": "Security is important, but it doesn't have to be complex. Let's dispel myths and assuage fear associated with those linchpin of our online lives – passwords – and build toward a more secure and more usable web.",
      "audio": null,
      "slug": "my-password-doesnt-work",
      "order": 5,
      "video": null,
      "title": "My Password Doesn't Work!"
    },
    {
      "speaker": {
        "name": "Mariko Kosaka",
        "photo": "https://2016.ffconf.org/images/speakers/mariko.jpg",
        "twitter": "kosamari",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2016
      },
      "description": "From improving performance 📈 of mobile web in 1999 to reacting with 👍 and 🎉 on our Pull Request in 2016, Emoji has become part of our daily communication. Emoji is fun and ambiguous, let's look at how it became part of our daily communication & how we can invent new use as creators of the web! ❤️ 💯 💁",
      "audio": null,
      "slug": "power-of-emoji",
      "order": 5,
      "video": null,
      "title": "Power of Emoji"
    },
    {
      "speaker": {
        "name": "Tobias Ahlin",
        "photo": "https://2014.ffconf.org/images/speakers/tobi.jpg",
        "twitter": "tobiasahlin",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2014
      },
      "description": "A day shouldn’t go by without you removing something. Design techniques and front-end optimization comes together in a behind-the-scenes look at what tools and techniques GitHub uses to make sure things render fast, with as little code as possible, and consistently.",
      "audio": null,
      "slug": "lean-mean-css-machine",
      "order": 5,
      "video": null,
      "title": "Lean Mean CSS Machine"
    },
    {
      "speaker": {
        "name": "Marcy Sutton",
        "photo": "https://2015.ffconf.org/images/speakers/marcy.jpg",
        "twitter": "marcysutton",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2015
      },
      "description": "The mobile web-vs-native debate rages on–who's winning? How can we create mobile experiences that are accessible and reliable to people with disabilities? In this talk, we'll dive head-first into the mobile debate and reemerge informed on how we can use our skills as web developers to create brilliant mobile apps.",
      "audio": null,
      "slug": "how-to-win-at-mobile-accessibility",
      "order": 5,
      "video": null,
      "title": "How to win at mobile accessibility"
    },
    {
      "speaker": {
        "name": "Kenneth Auchenberg",
        "photo": "https://2013.ffconf.org/images/speakers/kenneth.jpg",
        "twitter": "auchenberg",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2013
      },
      "description": "With the introduction of HTML5 the way we look at the browser has completely changed, but what has happen to our development workflow?\n\n\n\nIn this talk I take you through the history of web tooling and challenge the assumptions our current generation of tooling is build upon. You will realize that your web development workflow is completely broken, and that you over the years, have been making it gradually worse and more complex by adding more tools to the chain.\n\n\n\nIt's time to rethink our tooling.",
      "audio": null,
      "slug": "our-web-development-workflow-is-completely-broken",
      "order": 5,
      "video": null,
      "title": "Our web development workflow is completely broken"
    },
    {
      "speaker": {
        "name": "John Allsopp",
        "photo": "https://2012.ffconf.org/images/speakers/john.png",
        "twitter": "johnallsopp",
        "bio": "[John](http://johnfallsopp.com/) has been doing things to the web since before many of you were born. This is not necessarily a good thing."
      },
      "slides": null,
      "event": {
        "year": 2012
      },
      "description": "With the rise of web apps, the place of HTML, long the bedrock technology for web developers has become a little shakier. Widely used application frameworks like SenchaTouch and SproutCore effectively bypass HTML altogether, going straight from JavaScript to the DOM.\n\n\n\nSo is the era of HTML over? Or does it still have a place building web applications, as well as web pages?\n\n\n\nJohn Allsopp believes so, and in this presentation will consider in very practical terms why eschewing HTML in web application development may not be a great leap forward at all.\n\n\n\n",
      "audio": null,
      "slug": "is-html-relevent-in-the-era-of-web-apps",
      "order": 5,
      "video": null,
      "title": "Is HTML relevent in the era of web apps?"
    },
    {
      "speaker": {
        "name": "Willian Martins",
        "photo": "https://media.ffconf.org/2018/images/willian.jpg",
        "twitter": "wmsbill",
        "bio": "I started doing CS trying to be a game developer, but I ended up doing UI engineering instead which is as funny as playing PS4 ＼(＾▽＾)／."
      },
      "slides": "",
      "event": {
        "year": 2018
      },
      "description": "Do you want to discover the next exciting JavaScript features that you didn’t even know you needed? Let me present you three proposals that may change the way you write code the same way the spread operator did.",
      "audio": "",
      "slug": "back-to-the-future",
      "order": 5,
      "video": "",
      "title": "Back to the future of JS: the next features and amazing proposals"
    },
    {
      "speaker": {
        "name": "Jake Archibald",
        "photo": "https://2009.ffconf.org/images/speakers/jake.jpg",
        "twitter": "jaffathecake",
        "bio": "Jake worked on the BBC's Glow JavaScript library, talking about: Optimising where it hurts."
      },
      "slides": null,
      "event": {
        "year": 2009
      },
      "description": "As the amount of JavaScript we use on our pages increases, as does its effect on page performance. Even when browsers manage to produce the same output, how they reach that output can be very different. Some optimisations aren’t obvious, others can be easily broken by seemingly unrelated statements. So, how do we get the most out of our code?\n\n\n\nIn this session we'll challenge assumptions about performance, using practical code to demonstrate the optimisations that really make a difference, and why they make a difference.",
      "audio": null,
      "slug": "optimising-where-it-hurts",
      "order": 6,
      "video": null,
      "title": "Optimising where it hurts"
    },
    {
      "speaker": {
        "name": "Glenn Jones",
        "photo": "https://2011.ffconf.org/images/speakers/glenn.jpg",
        "twitter": "glennjones",
        "bio": "Glenn Jones is a Founder/Director of Madgex. After 20 years in digital design he is equally as passionate about coding as interaction design."
      },
      "slides": null,
      "event": {
        "year": 2011
      },
      "description": "The latest browser APIs now make it possible to redesign how your web pages interact with other applications. Web pages are too often little islands that fail to play well with the wider user interfaces of our devices. This talk will explore the possibilities from Drag and Drop to Web Intents, demonstrating how to make web pages more equal in the world of applications.",
      "audio": null,
      "slug": "beyond-the-page",
      "order": 6,
      "video": null,
      "title": "Beyond the page"
    },
    {
      "speaker": {
        "name": "Brian LeRoux",
        "photo": "https://2010.ffconf.org/images/speakers/brian_profile.jpg",
        "twitter": "brianleroux",
        "bio": "Co-creator of XUI and contributor to the open source PhoneGap project, Brian LeRoux believes that the future of the Internet is mobile and will rely on web standards, open source and developers like you. Brian is a software developer at Nitobi Software."
      },
      "slides": null,
      "event": {
        "year": 2010
      },
      "description": "We know the future of the web is mobile, but what's the future of mobile? In this session, you'll learn how to step-up mobile app development with widgets and device APIs. Add these two technologies to your toolbox to begin building next-gen mobile apps today.\n\n\n\nWith more than 4.6 billion handsets on the planet, we know the future of the web is mobile, but what's the future of mobile? The latest builds of mobile browsers include HTML5 APIs, which enable speedy hardware-accelerated CSS, offline capability, client-side storage, geolocation and other goodies. But, what's next?\n\n\n\nTwo web technologies are ushering in the next generation of mobile apps: widgets and device APIs. As self-contained web apps, widgets significantly improve user experience. Device APIs do more than extend web apps to mobile devices. They allow access to native device sensors, like the accelerometer and camera, and to data such as photos and contacts. By adding widgets and device APIs to your toolbox, you can start building sophisticated mobile apps now.\n\n\n\nIn this session, PhoneGap hacker Brian LeRoux will guide you through the step-by-step creation of a W3C widget. He'll show you how to combine it with device APIs and deploy it using the PhoneGap open source framework. Learn how to develop for the mobile web of the future, today.",
      "audio": null,
      "slug": "phonegap-the-future-of-mobile-now",
      "order": 6,
      "video": null,
      "title": "PhoneGap: the Future of Mobile Now"
    },
    {
      "speaker": {
        "name": "Umar Hansa",
        "photo": "https://2016.ffconf.org/images/speakers/umar.jpg",
        "twitter": "umaar",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2016
      },
      "description": "Learn about new DevTools features which can greatly enhance your workflow. Also, native Node.js debugging straight from DevTools!",
      "audio": null,
      "slug": "optimise-your-web-development-workflow",
      "order": 6,
      "video": null,
      "title": "Optimise your Web Development Workflow"
    },
    {
      "speaker": {
        "name": "Katie Fenn",
        "photo": "https://2017.ffconf.org/images/speakers/katie.gif",
        "twitter": "katie_fenn",
        "bio": "In 2001 I started making post signatures for a Final Fantasy forum, and then started coding new features for the forum itself."
      },
      "slides": null,
      "event": {
        "year": 2017
      },
      "description": "JavaScript does a remarkable job of hiding memory management from us. What's going on behind the scenes?",
      "audio": null,
      "slug": "memory-dont-forget-to-take-out-the-garbage",
      "order": 6,
      "video": null,
      "title": "Memory: Don't Forget to Take Out the Garbage"
    },
    {
      "speaker": {
        "name": "Paul Lewis",
        "photo": "https://2015.ffconf.org/images/speakers/paul.jpg",
        "twitter": "aerotwist",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2015
      },
      "description": "\"You should use [insert library or framework here], it's the bestestest!\" is pretty standard modern web development chatter. But how do you separate the hype from the reality? Let's have a look at how we can gather data to assess the fit of code to your projects.",
      "audio": null,
      "slug": "you-should-use-lessinsert-libraryframeworkgreater-its-the-bestestest",
      "order": 6,
      "video": null,
      "title": "You should use <insert library/framework>, it's the bestestest!"
    },
    {
      "speaker": {
        "name": "Henrik Joreteg",
        "photo": "https://2014.ffconf.org/images/speakers/henrik.jpg",
        "twitter": "HenrikJoreteg",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2014
      },
      "description": "Single page apps have become a legitimate part of the web, but what role should they play? Where do they shine? Where do they fail? How should we think about them and how can we evaluate tools for building them? We will opine on the tradeoffs of abstractions and frameworks and share &yet's impetus for creating Ampersand.js.",
      "audio": null,
      "slug": "a-single-page-story",
      "order": 6,
      "video": null,
      "title": "A Single Page Story"
    },
    {
      "speaker": {
        "name": "Andrew Betts",
        "photo": "https://2012.ffconf.org/images/speakers/andrew.png",
        "twitter": "triblondon",
        "bio": "Founder of [Assanka](http://assanka.net), the company acquired earlier this year by the FT, Andrew now heads up FT Labs (the team that builds some of the world's finest HTML5 web apps) and is co-chair of the W3C 'Fixing appcache' community group."
      },
      "slides": null,
      "event": {
        "year": 2012
      },
      "description": "In the last couple of years a deluge of new offline storage technologies have appeared.  I'll explain why they are all excellent and rubbish at the same time, why you need to use all of them, and walk through the techniques to consider when building a web application that can load and function with no network connectivity. But making use of client side storage is not just necessary to make an app that works offline - it can also hugely improve the user experience of your site when the user does have connectivity as well. The examples will feature real-life code from our FT and the Economist applications, so you know that the techniques here are applicable to large, complex problems and not just contrived examples.\n\n\n\n",
      "audio": null,
      "slug": "offline-rules-using-new-browser-technologies-to-make-sites-work-offline-and-be-more-awesome-online",
      "order": 6,
      "video": null,
      "title": "Offline Rules: using new browser technologies to make sites work offline and be more awesome online"
    },
    {
      "speaker": {
        "name": "Ana Tudor",
        "photo": "https://2013.ffconf.org/images/speakers/ana.jpg",
        "twitter": "thebabydino",
        "bio": "Loves maths, especially geometry. Enjoys playing with code. Passionate about experimenting & learning new things. Fascinated by astrophysics and science in general. Huge fan of technological advance & its applications in all fields. Shows an interest in motor sports, drawing, classic cartoons, rock music, cuddling toys and animals with sharp claws & big teeth. Dreams about owning a real tiger."
      },
      "slides": null,
      "event": {
        "year": 2013
      },
      "description": "Everybody has probably seen mathematical visualizations that were created using JavaScript. However, one thing that not everybody may know is that some of them can be perfectly replicated using nothing but HTML and CSS.\n\n\n\nThis talk is going to deconstruct some examples, explain the mathematical reasoning behind, reveal a few lesser known things about certain CSS properties and show how using a preprocessor can help with keeping these demos extremely customizable while actually writing very little code.",
      "audio": null,
      "slug": "stunning-visuals-with-maths-andno-javascript",
      "order": 6,
      "video": null,
      "title": "Stunning visuals with Maths and...no JavaScript?"
    },
    {
      "speaker": {
        "name": "Charlie Owen",
        "photo": "https://media.ffconf.org/2018/images/charlie.jpg",
        "twitter": "sonniesedge",
        "bio": "I realised I wasn't an engineer the second I started making things for the web. I'm a designer (a very grumpy one). That doesn't mean I don't code. It's just that I design for people first, rather than skipping ahead to the technology."
      },
      "slides": "",
      "event": {
        "year": 2018
      },
      "description": "What is the Web really about? Who do we develop our products for? Is it designed for Silicon Valley rock star 10x ninja frontend engineers to have fun coding on? Or is the Web a place for users from all walks of life, using all kinds of technologies, who might be using your product in the most stressful situations?",
      "audio": "",
      "slug": "dear-developer",
      "order": 6,
      "video": "",
      "title": "Dear Developer, the Web Isn't About You"
    },
    {
      "speaker": {
        "name": "Simon Willison",
        "photo": "https://2009.ffconf.org/images/speakers/simon.jpg",
        "twitter": "simonw",
        "bio": "International speaker and renowned developer, talking about Web API mischief with JavaScript."
      },
      "slides": null,
      "event": {
        "year": 2009
      },
      "description": "JSON-P and other cross-domain skullduggery have enabled mashup possibilities far beyond JavaScript's original remit. Discover tricks for blasting apart the same origin policy and exploiting online services to build all manner of intriguing applications using nothing more than a sprinkling of JavaScript and static HTML.\n\n\n\nLearn how HTML5 will embrace such trickery and make JavaScript the natural choice for combining data in interesting new ways.",
      "audio": null,
      "slug": "node",
      "order": 7,
      "video": null,
      "title": "Node"
    },
    {
      "speaker": {
        "name": "Brendan Dawes",
        "photo": "https://2011.ffconf.org/images/speakers/brendan.jpg",
        "twitter": "brendandawes",
        "bio": "Brendan Dawes is Creative Director for magneticNorth, a digital design company based in Manchester, UK."
      },
      "slides": null,
      "event": {
        "year": 2011
      },
      "description": "Brendan Dawes is a big-a-geek as anyone; he loves nothing more than making and experimenting with all the wondrous technologies, tools, toys and other magical things that constantly surround us. But the thing is, geeks never changed anything, well not in a real-world sense. Making cutting edge Javascript demos with the likes of Canvas or SVG are all well and good but for things to really change and have an impact stuff needs to move beyond the confines of the world of the geek and become common place, the norm and paradoxically, invisible!",
      "audio": null,
      "slug": "beyond-the-planet-of-the-geeks",
      "order": 7,
      "video": null,
      "title": "Beyond The Planet Of The Geeks"
    },
    {
      "speaker": {
        "name": "Ashley Williams",
        "photo": "https://2016.ffconf.org/images/speakers/ashley.jpg",
        "twitter": "ag_dubs",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2016
      },
      "description": "\"MAKE IT MODULAR,\" they said. \"IT WILL BE BETTER,\" they said. Modularity is a term so common in today, that it's easy to uncritically accept it as a fundamental development principle. What does \"modularity\" *actually* mean? We will talk through the technical etymology of \"modularity\" and examine history on both its current use today, and where it's heading in the future.",
      "audio": null,
      "slug": "a-brief-history-and-mishistory-of-modularity",
      "order": 7,
      "video": null,
      "title": "A brief history and mishistory of modularity"
    },
    {
      "speaker": {
        "name": "Seb Lee-Delisle",
        "photo": "https://2010.ffconf.org/images/speakers/seb_profile.jpg",
        "twitter": "seb_ly",
        "bio": "Seb has been working in digital media for over 15 years and is the founding partner at award winning digital agency Plug-in Media. He is a specialist in games, physics, motion detection, 3D and visual effects (such as particle systems). His work has pushed the boundaries of what is possible on the web, and has received many accolades including a BAFTA for the Plug-in Media project Big and Small.\n\n\n\nAs a member of the Papervision3D team, he is an expert in 3D. He is regularly invited to speak at conferences, and has presented at iDesign, FITC, FlashForward and many others."
      },
      "slides": null,
      "event": {
        "year": 2010
      },
      "description": "Seb Lee-Delisle brings his experience programming visual effects from the World of Flash to the Universe of JavaScript to show how to create dynamic canvas effects. He'll also show how you can now use JavaScript within unity3d to produce console quality games that run in the browser, on your iPhone and even on your Xbox!",
      "audio": null,
      "slug": "pixel-pushing",
      "order": 7,
      "video": null,
      "title": "Pixel Pushing"
    },
    {
      "speaker": {
        "name": "Jenn Schiffer",
        "photo": "https://2017.ffconf.org/images/speakers/jenn.gif",
        "twitter": "jennschiffer",
        "bio": "my kid laptop had a hangman game written in BASIC and i accessed the source and rigged it to cheat against my half sister!"
      },
      "slides": null,
      "event": {
        "year": 2017
      },
      "description": "aesthetic is a major component of any medium for art, including the web, but one thing that has been bothering me lately is: what happened to \"view source\"? are we destroying aesthetic for the sake of tooling and in spite of access to our industry????¿¿¿¿",
      "audio": null,
      "slug": "abstract-art-in-a-time-of-minification",
      "order": 7,
      "video": null,
      "title": "Abstract art in a time of minification"
    },
    {
      "speaker": {
        "name": "Soledad Penadés",
        "photo": "https://2014.ffconf.org/images/speakers/sole.jpg",
        "twitter": "supersole",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2014
      },
      "description": "In this talk we'll learn how Web Audio works and how we can use it to design and play sounds with incredible accuracy, which enables us to create our own real-time instruments and interactive experiences. We'll also identify the ferocious gotchas that are waiting to bite you when you least expect them, and gain valuable Web Audio debugging skills using Firefox's developer tools. At the end of the talk you'll be all set in your path to become 21st century music pioneers—or at least have a ton of creative fun!",
      "audio": null,
      "slug": "tools-for-the-21st-century-musician",
      "order": 7,
      "video": null,
      "title": "Tools for the 21st century musician"
    },
    {
      "speaker": {
        "name": "Martin Kleppe",
        "photo": "https://2015.ffconf.org/images/speakers/martin.jpg",
        "twitter": "aemkei",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2015
      },
      "description": "Programming is art: It is like painting, but instead of drawing on a canvas we populate computer screens with colours. And rather than using brushes, we combine bits and bytes to trace an ever-changing flow of images.\n\n\n\nIn this talk, you'll be introduced to the art of \"Creative Coding\" and how to generate beautiful new worlds, using nothing else than the languages of the Web.",
      "audio": null,
      "slug": "code-calligrams",
      "order": 7,
      "video": null,
      "title": "Code Calligrams"
    },
    {
      "speaker": {
        "name": "James Pearce",
        "photo": "https://2012.ffconf.org/images/speakers/james.png",
        "twitter": "jamespearce",
        "bio": "Head of Mobile Developer Relations at Facebook, a developer and writer with a special passion for mobile and exploring its untapped potential."
      },
      "slides": null,
      "event": {
        "year": 2012
      },
      "description": "The Web's place in history as a flexible & fluid way to store documents is well assured. But in a post-PC world, it's got work to do, and it's looking a little out of its depth. The Web's best hope for the future is if we think about it a little differently and admit what we must do to address its shortcomings.\n\n\n\n",
      "audio": null,
      "slug": "how-i-stopped-worrying-and-learned-to-love-the-lessbodygreater",
      "order": 7,
      "video": null,
      "title": "How I stopped worrying and learned to love the <body/>"
    },
    {
      "speaker": {
        "name": "Angelina Fabbro",
        "photo": "https://2013.ffconf.org/images/speakers/angelina.jpg",
        "twitter": "null",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2013
      },
      "description": "In this tutorial we'll take a deep dive into how Web Components (A collection of technologies that includes Shadow DOM, HTML Templates, Custom Elements, and HTML Imports) can be used as building blocks to construct a functioning web application.\n\n\n\nWe'll review how each of the technologies under the web components umbrella work, how they work together, and how x-tags makes use of them to make modular, lightweight components. Special attention will be given to building applications for mobile devices with environments such as Firefox OS, Chrome OS, and PhoneGap.",
      "audio": null,
      "slug": "building-with-web-components-using-x-tags",
      "order": 7,
      "video": null,
      "title": "Building with Web Components using X-Tags"
    },
    {
      "speaker": {
        "name": "Remy Sharp",
        "photo": "https://media.ffconf.org/2018/images/rem.jpg",
        "twitter": "rem",
        "bio": "My dad gave me a ZX BASIC listing for Star Wars, in '88 (I think?). I spent the day coding. My codes did not work. So began my devlife."
      },
      "slides": "",
      "event": {
        "year": 2018
      },
      "description": "These days people chase the dream of high performance, fast loading slick web sites. But in the 1980s computers were ugly, slow and loud: let’s make that instead 👴👵💪",
      "audio": "",
      "slug": "slow-and-loud",
      "order": 7,
      "video": "",
      "title": "Using a Modern Web to Recreate 1980s Horribly Slow & Loud Loading Screens"
    },
    {
      "speaker": {
        "name": "Marcin Wichary",
        "photo": "https://2011.ffconf.org/images/speakers/marcin.jpg",
        "twitter": "mwichary",
        "bio": "Marcin Wichary has been coding HTML by hand since 1994 and still finds it fascinating today as a senior user experience designer and developer at Google."
      },
      "slides": null,
      "event": {
        "year": 2011
      },
      "description": "HTML is incredible and powerful. HTML is a mess. Marcin, a user experience designer at Google, will talk about the experience working on interactive doodles like Pac-Man, Jules Verne and Les Paul. How do we put together things that will be seen by hundreds millions of people? What did we get right? What did we learn the hard way? What rules were broken and what contraptions put together? (Oh, and make sure to bring your phones!)",
      "audio": null,
      "slug": "you-gotta-do-what-you-gotta-do",
      "order": 8,
      "video": null,
      "title": "You gotta do what you gotta do"
    },
    {
      "speaker": {
        "name": "Lena Reinhard",
        "photo": "https://2015.ffconf.org/images/speakers/lena.jpg",
        "twitter": "lrnrd",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2015
      },
      "description": "Software influences the lives of billions of humans every day. As people working on it, we face a broad variety of challenges – and we have a responsibility towards each of these humans. Let's take a look at the status of software development today, and see what each of us can do to act according to this responsibility.",
      "audio": null,
      "slug": "a-talk-about-everything",
      "order": 8,
      "video": null,
      "title": "A Talk about Everything"
    },
    {
      "speaker": {
        "name": "Mathieu 'p01' Henri",
        "photo": "https://2016.ffconf.org/images/speakers/mathieu.jpg",
        "twitter": "p01",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2016
      },
      "description": "What is creative coding, especially with realtime animations and data visualisation. Looking at the animation loop, some gotchas & tricks (e.g. cheap motion blur or glow), sound synthesis, and more. Then we'll do a live coding session to put in this practice, have fun and create something cool together!",
      "audio": null,
      "slug": "artjs",
      "order": 8,
      "video": null,
      "title": "Art.js"
    },
    {
      "speaker": {
        "name": "Joe Hart",
        "photo": "https://2017.ffconf.org/images/speakers/joe.gif",
        "twitter": "joehart",
        "bio": "Parents got me Lego Mindstorms for Xmas, used it and got frustrated that the software didn't let me do exactly what I wanted. Thus here I am"
      },
      "slides": null,
      "event": {
        "year": 2017
      },
      "description": "A live performance of video games and stand up comedy from comedian and coder, including pre prepared web games to play and even creating a video game with the audience on stage in only 10 minutes.",
      "audio": null,
      "slug": "alpha-beta-gamer-dev-mode",
      "order": 8,
      "video": null,
      "title": "Alpha, Beta, Gamer: Dev Mode"
    },
    {
      "speaker": {
        "name": "Ben Foxall",
        "photo": "https://2014.ffconf.org/images/speakers/ben.jpg",
        "twitter": "benjaminbenben",
        "bio": ""
      },
      "slides": null,
      "event": {
        "year": 2014
      },
      "description": "The web platform allows us to interact with people on the other side of the planet, but in what other ways can we use it when our devices are right next to each other?",
      "audio": null,
      "slug": "getting-close-with-the-web",
      "order": 8,
      "video": null,
      "title": "Getting Close with the Web"
    },
    {
      "speaker": {
        "name": "Jeremy Keith",
        "photo": "https://2013.ffconf.org/images/speakers/jeremy.jpg",
        "twitter": "adactio",
        "bio": "Jeremy Keith lives in Brighton, England where he makes websites with the splendid design agency [Clearleft](http://clearleft.com). You may know him from such books as [DOM Scripting: JavaScript’s New Hope](http://domscripting.com/), [Bulletproof Ajax: The Browser Strikes Back](http://bulletproofajax.com/), and [HTML5 For Web Designers: Return Of The Standards](http://html5forwebdesigners.com/).\n\n\n\nHe’s the curator of the [dConstruct conference](http://dconstruct.org/) as well as [Brighton SF](http://brightonsf.adactio.com/), and he organised the world’s first [Science Hack Day](http://sciencehackday.com/). He also made the website [Huffduffer](http://huffduffer.com/) to allow people to make podcasts of found sounds—it’s like Instapaper for audio files.\n\n\n\nJeremy spends most of his time goofing off on the internet, documenting his time-wasting on [adactio.com](http://adactio.com), where he has been writing for over ten years."
      },
      "slides": null,
      "event": {
        "year": 2013
      },
      "description": "This thing all things devours:  \n\nBirds, beasts, trees, flowers;  \n\nGnaws iron, bites steel;  \n\nGrinds hard stones to meal;  \n\nSlays king, ruins town,  \n\nAnd beats high mountain down",
      "audio": null,
      "slug": "time",
      "order": 8,
      "video": null,
      "title": "Time"
    },
    {
      "speaker": {
        "name": "Anna Debenham",
        "photo": "https://2012.ffconf.org/images/speakers/anna.png",
        "twitter": "anna_debenham",
        "bio": "Anna is a freelance front end developer based in Brighton. She mostly works on projects in education and tweets a lot about Adventure Time."
      },
      "slides": null,
      "event": {
        "year": 2012
      },
      "description": "With IE coming to the Xbox, console browsers are growing up fast. We've advanced to a new level of exciting challenges in the form of voice recognition, gestural interfaces and second screens and it's time we start thinking about how our sites will work with these.\n\n\n\nWe'll race through the console landscape, unlock the treasure chest of features, and prepare ourselves for battle with the browser.\n\n\n\n",
      "audio": null,
      "slug": "exploring-the-game-console-browser-landscape",
      "order": 8,
      "video": null,
      "title": "Exploring the game console browser landscape"
    },
    {
      "speaker": {
        "name": "Tim Holman",
        "photo": "https://media.ffconf.org/2018/images/timothy.jpg",
        "twitter": "twholman",
        "bio": "Always enjoyed creating things, and web was the platform that stuck. If I can do it, anyone can!"
      },
      "slides": "",
      "event": {
        "year": 2018
      },
      "description": "Code is for work, but also for play. We have so much power at our fingertips, it would be silly not to relax every now and then and make something weird. Hang with Tim, and get inspired to create!",
      "audio": "",
      "slug": "weird-web",
      "order": 8,
      "video": "",
      "title": "Weird Web & Curious Creation"
    }
  ]
}
